# Sorting in Series and Dataframe

In [2]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series

In [3]:
ser5=Series(np.random.randint(1,50,10),index=list('ABCDEFGHIJ'))
ser5

A    38
B     7
C    30
D    14
E    36
F    21
G    15
H    37
I    29
J    15
dtype: int32

In [4]:
var=ser5.sort_values() #By default ascending

In [6]:
var

B     7
D    14
G    15
J    15
F    21
I    29
C    30
E    36
H    37
A    38
dtype: int32

In [7]:
var1=ser5.sort_values(ascending=False)
var1

A    38
H    37
E    36
C    30
I    29
F    21
J    15
G    15
D    14
B     7
dtype: int32

In [10]:
var2=ser5.sort_index()
var2

A    38
B     7
C    30
D    14
E    36
F    21
G    15
H    37
I    29
J    15
dtype: int32

In [11]:
df = DataFrame(np.random.randint(1,100,30).reshape(10,3),columns=['English','Hindi','Science'],index=list('ABCDEFGHIJ'))
df

   English  Hindi  Science
A       99     89       42
B       78     42       22
C       51     57       28
D       41     56       48
E       74     17       75
F       63     66       77
G       16      1       70
H       66     85       39
I       11     34        1
J        1     89       81

In [13]:
df.sort_values(by='Hindi')

   English  Hindi  Science
G       16      1       70
E       74     17       75
I       11     34        1
B       78     42       22
D       41     56       48
C       51     57       28
F       63     66       77
H       66     85       39
A       99     89       42
J        1     89       81

In [14]:
df.sort_values(by='Hindi',ascending=False)

   English  Hindi  Science
A       99     89       42
J        1     89       81
H       66     85       39
F       63     66       77
C       51     57       28
D       41     56       48
B       78     42       22
I       11     34        1
E       74     17       75
G       16      1       70

In [16]:
df.sort_values(by=['Hindi','English'],ascending=False) #1st preference to hindi

   English  Hindi  Science
A       99     89       42
J        1     89       81
H       66     85       39
F       63     66       77
C       51     57       28
D       41     56       48
B       78     42       22
I       11     34        1
E       74     17       75
G       16      1       70

In [17]:
df[df<40]

   English  Hindi  Science
A      NaN    NaN      NaN
B      NaN    NaN     22.0
C      NaN    NaN     28.0
D      NaN    NaN      NaN
E      NaN   17.0      NaN
F      NaN    NaN      NaN
G     16.0    1.0      NaN
H      NaN    NaN     39.0
I     11.0   34.0      1.0
J      1.0    NaN      NaN

# Rank

In [18]:
ser1=Series(np.random.randint(1,50,10),index=list('ABCDEFGHIJ'))
ser1

A    44
B    24
C    21
D    38
E    49
F    27
G    13
H    37
I    42
J    38
dtype: int32

In [19]:
ser1.rank() #6.5 is the mean value of 6+7as 38 is repeated value

A     9.0
B     3.0
C     2.0
D     6.5
E    10.0
F     4.0
G     1.0
H     5.0
I     8.0
J     6.5
dtype: float64

In [20]:
ser1.rank(method='min') # when we use method min we take lower rank ad then skip the upper rank

A     9.0
B     3.0
C     2.0
D     6.0
E    10.0
F     4.0
G     1.0
H     5.0
I     8.0
J     6.0
dtype: float64

In [21]:
ser1.rank(method='max') #chooses the max value of two ranks

A     9.0
B     3.0
C     2.0
D     7.0
E    10.0
F     4.0
G     1.0
H     5.0
I     8.0
J     7.0
dtype: float64

In [22]:
ser1.rank(method='dense') #proper method for rank

A    8.0
B    3.0
C    2.0
D    6.0
E    9.0
F    4.0
G    1.0
H    5.0
I    7.0
J    6.0
dtype: float64

In [23]:
df

   English  Hindi  Science
A       99     89       42
B       78     42       22
C       51     57       28
D       41     56       48
E       74     17       75
F       63     66       77
G       16      1       70
H       66     85       39
I       11     34        1
J        1     89       81

In [29]:
df['percentage']=((df['English']+df['Hindi']+df['Science'])/300)*100

In [30]:
df

   English  Hindi  Science  percentage
A       99     89       42   76.666667
B       78     42       22   47.333333
C       51     57       28   45.333333
D       41     56       48   48.333333
E       74     17       75   55.333333
F       63     66       77   68.666667
G       16      1       70   29.000000
H       66     85       39   63.333333
I       11     34        1   15.333333
J        1     89       81   57.000000

In [36]:
df['Rank']=df.percentage.rank(method='dense')

In [37]:
df

   English  Hindi  Science  percentage  Rank
A       99     89       42   76.666667  10.0
B       78     42       22   47.333333   4.0
C       51     57       28   45.333333   3.0
D       41     56       48   48.333333   5.0
E       74     17       75   55.333333   6.0
F       63     66       77   68.666667   9.0
G       16      1       70   29.000000   2.0
H       66     85       39   63.333333   8.0
I       11     34        1   15.333333   1.0
J        1     89       81   57.000000   7.0

In [40]:
ser2=Series(['One','Two','Three',np.nan])

In [41]:
ser2

0      One
1      Two
2    Three
3      NaN
dtype: object

In [42]:
ser2.isnull()

0    False
1    False
2    False
3     True
dtype: bool

In [43]:
ser2.notnull()

0     True
1     True
2     True
3    False
dtype: bool

In [44]:
ser2.isnull().sum() #by default functn in python = sum

1

In [47]:
ser2.dropna() #to drop null(NaN) value

0      One
1      Two
2    Three
dtype: object

In [52]:
df1=DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [53]:
df1.dropna()

     0    1    2
0  1.0  2.0  3.0

In [54]:
df1.dropna(axis=1) #for column axis =1

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [55]:
df1.dropna(how='all') #for all null values replace

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [56]:
df1.dropna(thresh=1) #thresh value(1 means check ATLEAST one values)

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [57]:
df1.dropna(thresh=2)

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [58]:
df1.dropna(thresh=3)

     0    1    2
0  1.0  2.0  3.0

In [62]:
df1.dropna(thresh=1)

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [63]:
df1.dropna(thresh=3 ,axis=1)

     2
0  3.0
1  6.0
2  9.0
3  NaN